Template_Cases/HydralloyC5_Desorption/0/hydrogenArea/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/hydrogenArea";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(tankWall.*)"
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            wedge;
    }

    hydrogenArea_to_metalArea
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
