Template_Cases/HydralloyC5_Desorption/0/metalArea/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
	location    "0/metalArea";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../../constant/metalHydrideSettings";

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    tankWall
    {
      type                groovyBC;
      variables           "lambda_eff=$epsilon_metal*$lambda_hydrogen+(1-$epsilon_metal)*$lambda_metal;";
      valueExpression     "293.15";
      gradientExpression  "0";
      fractionExpression  "1/(1+(lambda_eff/($h_metal*mag(delta())))*(($lambda_wall+$h_metal*$delta_wall)/$lambda_wall))";
      value               $internalField;
    }

    "(front|back)"
    {
        type            wedge;
    }

    metalArea_to_hydrogenArea
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
