Template_Cases/HydralloyC5_Desorption/0/metalArea/rhoGas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/metalArea";
    object      rhoGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform #calc "2.01588e-3 * 40e5 / (8.3145*293.15)";

boundaryField
{
    "(tankWall.*)"
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            wedge;
    }

    metalArea_to_hydrogenArea
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
