Template_Cases/HydralloyC5_Desorption/0/metalArea/rhoMetal
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/metalArea";
    object      rhoMetal;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 6209.8;

boundaryField
{
    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    tankWall
    {
        type            zeroGradient;
    }

    metalArea_to_hydrogenArea
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
